# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]  # summary: 501 layers, 20,201,216 parameters, 20,201,200 gradients, 68.1 GFLOPs
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLOv12m backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2]]     # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, GhostConv,  [256, 3, 2]]     # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, GhostConv,  [512, 3, 2]]     # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, GhostConv,  [1024, 3, 2]]    # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLOv12m head
head:
head:
  - [8, 1, nn.Upsample, [None, 2, "nearest"]]           # 9: upsample P5 → P4
  - [[-1, 5], 1, Concat, [1]]                           # 10: concat with backbone P4 (layer 5)
  - [-1, 2, A2C2f, [512, False, -1]]                    # 11: P4 processed

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 12: upsample P4 → P3
  - [[-1, 3], 1, Concat, [1]]                           # 13: concat with backbone P3 (layer 3)
  - [-1, 2, A2C2f, [256, False, -1]]                    # 14: P3 processed

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]       # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 17
                            
  - [11, 1, CBAM, [512, 7]]                             # 16: CBAM on P4

  - [16, 1, nn.Upsample, [None, 2, "nearest"]]          # 17: upsample P4 CBAM (16x16 → 32x32)
  - [[15, 17], 1, Concat, [1]]                          # 18: fuse CBAM P3 + upsampled CBAM P4
  - [-1, 2, C3k2, [1024, True]]                         # 19: final fusion

  - [[14, 11, 19], 1, Detect, [nc]]                     # 20: Detect(P3, P4, P5)


